dizcza/firmware/variants/ut2uh/k46v2/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define EXTERNAL_NUM_INTERRUPTS 19
#define NUM_DIGITAL_PINS 20
#define NUM_ANALOG_INPUTS 19

#define analogInputToDigitalPin(p) (((p) < 20) ? (analogChannelToDigitalPin(p)) : -1)
#define digitalPinToInterrupt(p) (((p) < 40) ? (p) : -1)
#define digitalPinHasPWM(p) (p < 34)

static const uint8_t TX = 1;
static const uint8_t RX = 3;

static const uint8_t TXD2 = -1;
static const uint8_t RXD2 = -1;

static const uint8_t SDA = 22;
static const uint8_t SCL = 21;

static const uint8_t SS = 25;
static const uint8_t MOSI = 2;
static const uint8_t MISO = 16;
static const uint8_t SCK = 15;

static const uint8_t G23 = 23;
static const uint8_t G19 = 19;
static const uint8_t G18 = 18;
static const uint8_t G3 = 3;
static const uint8_t G16 = 16;
static const uint8_t G21 = 21;
static const uint8_t G2 = 2;
static const uint8_t G12 = 12;
static const uint8_t G15 = 15;
static const uint8_t G35 = 35;
static const uint8_t G36 = 36;
static const uint8_t G25 = 25;
static const uint8_t G26 = 26;
static const uint8_t G1 = 1;
static const uint8_t G17 = 17;
static const uint8_t G22 = 22;
static const uint8_t G5 = 5;
static const uint8_t G13 = 13;
static const uint8_t G0 = 0;
static const uint8_t G34 = 34;

// static const uint8_t DAC1 = 25;
// static const uint8_t DAC2 = 26;

static const uint8_t ADC1 = 35;


#endif /* Pins_Arduino_h */
